<a href="https://colab.research.google.com/github/samirlenka/pandas_exercises/blob/master/05_Merge/Fictitous%20Names/Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Fictitious Names

### Introduction:

This time you will create a data again 

Special thanks to [Chris Albon](http://chrisalbon.com/) for sharing the dataset and materials.
All the credits to this exercise belongs to him.  

In order to understand about it go [here](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/).

### Step 1. Import the necessary libraries

In [4]:
import pandas as pd
import numpy as np

### Step 2. Create the 3 DataFrames based on the following raw data

In [1]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### Step 3. Assign each to a variable called data1, data2, data3

In [16]:
data1 = pd.DataFrame(raw_data_1, columns = ['subject_id', 'first_name', 'last_name'])
data2 = pd.DataFrame(raw_data_2, columns = ['subject_id', 'last_name', 'first_name'])
data3 = pd.DataFrame(raw_data_3, columns = ['subject_id', 'test_id'])
data1.head(5)
#data2.head(5)
data3.head(5)

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16

### Step 4. Join the two dataframes along rows and assign all_data

In [28]:
all_data = pd.concat([data1, data2], axis = 0)
all_data

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

### Step 5. Join the two dataframes along columns and assing to all_data_col

In [24]:
all_data_col = pd.concat([data1, data2], axis = 1)
all_data_col

  subject_id first_name last_name subject_id last_name first_name
0          1       Alex  Anderson          4    Bonder      Billy
1          2        Amy  Ackerman          5     Black      Brian
2          3      Allen       Ali          6   Balwner       Bran
3          4      Alice      Aoni          7     Brice      Bryce
4          5     Ayoung   Atiches          8    Btisan      Betty

### Step 6. Print data3

In [32]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 7. Merge all_data and data3 along the subject_id value

In [35]:
pd.merge(all_data, data3, on = 'subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

### Step 8. Merge only the data that has the same 'subject_id' on both data1 and data2

In [38]:
pd.merge(data1, data2, on = "subject_id", how = 'inner')

  subject_id first_name_x last_name_x last_name_y first_name_y
0          4        Alice        Aoni      Bonder        Billy
1          5       Ayoung     Atiches       Black        Brian

### Step 9. Merge all values in data1 and data2, with matching records from both sides where available.

In [42]:
pd.merge(data1, data2, on = 'subject_id', how = 'outer')

  subject_id first_name_x last_name_x last_name_y first_name_y
0          1         Alex    Anderson         NaN          NaN
1          2          Amy    Ackerman         NaN          NaN
2          3        Allen         Ali         NaN          NaN
3          4        Alice        Aoni      Bonder        Billy
4          5       Ayoung     Atiches       Black        Brian
5          6          NaN         NaN     Balwner         Bran
6          7          NaN         NaN       Brice        Bryce
7          8          NaN         NaN      Btisan        Betty